BoundaryTests/02Tests/totalPressureSpeedAlternateTest/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    cyclicFacesFaceSet;
        type    faceSet;
        action  new;
        source  cylinderToFace;
        p1      (-0.01 0 0);
        p2      ( 0.01 0 0);
        radius  0.06;
    }

    {
        name    cyclicFacesSlaveCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-10 -10 -10)(0 10 10);
    }

    {
        name    cyclicFaces;
        type    faceZoneSet;
        action  new;
        source  setsToFaceZone;
        faceSet cyclicFacesFaceSet;
        cellSet cyclicFacesSlaveCells;
    }

    {
        name    baffleFaceSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.001 -10 -10)(0.001 10 10);
    }

    {
        name    baffleFaceSet;
        type    faceSet;
        action  subtract;
        source  boxToFace;
        source  cylinderToFace;
        p1      (-0.01 0 0);
        p2      ( 0.01 0 0);
        radius  0.06;
    }

    {
        name    baffleFaces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet baffleFaceSet;
    }
);


// ************************************************************************* //
